podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_PLL_DIG_MKW41Z4.svd.xml
<!--
Devices using this peripheral: 
      MKW41Z4
-->
      <peripheral>
         <?sourceFile "XCVR_PLL_DIG_MKW41Z4" ?>
         <name>XCVR_PLL_DIG</name>
         <description>XCVR_PLL_DIG</description>
         <groupName>XCVR_PLL_DIG</groupName>
         <headerStructName>XCVR_PLL_DIG</headerStructName>
         <baseAddress>0x4005C224</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x58</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>HPM_BUMP</name>
               <description>PLL HPM Analog Bump Control</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x1010</resetValue>
               <fields>
                  <field>
                     <name>HPM_VCM_TX</name>
                     <description>rfctrl_tx_dac_bump_vcm[2:0] during Transmission</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>432 mV</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>328 mV</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>456 mV</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>473 mV</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>488 mV</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>408 mV</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>392 mV</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>376 mV</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="HPM_VCM_TX" > <name>HPM_VCM_CAL</name> <description>rfctrl_tx_dac_bump_vcm[2:0] during Calibration</description> <bitOffset>4</bitOffset> </field>
                  <field>
                     <name>HPM_FDB_RES_TX</name>
                     <description>rfctrl_tx_dac_bump_fdb_res[1:0] during Transmission</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>29 kohms</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>58 kohms(gain of 2)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>13 kohms</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>23.7 kohms</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="HPM_FDB_RES_TX" > <name>HPM_FDB_RES_CAL</name> <description>rfctrl_tx_dac_bump_fdb_res[1:0] during Calibration</description> <bitOffset>12</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>MOD_CTRL</name>
               <description>PLL Modulation Control</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>MODULATION_WORD_MANUAL</name>
                     <description>Manual Modulation Word</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>MOD_DISABLE</name>
                     <description>Disable Modulation Word</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_MOD_MANUAL</name>
                     <description>Manual HPM Modulation</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>HPM_MOD_DISABLE</name>
                     <description>Disable HPM Modulation</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_SDM_OUT_MANUAL</name>
                     <description>Manual HPM SDM out</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>HPM_SDM_OUT_DISABLE</name>
                     <description>Disable HPM SDM out</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHAN_MAP</name>
               <description>PLL Channel Mapping</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0x200</resetValue>
               <fields>
                  <field>
                     <name>CHANNEL_NUM</name>
                     <description>Protocol specific Channel Number for PLL Frequency Mapping</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>BOC</name>
                     <description>BLE Channel Number Override</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>BLE channel number comes from the BLE Link Layer</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>BLE channel number comes from the CHANNEL_NUM register (BLE protocols 0 and 2)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BMR</name>
                     <description>BLE MBAN Channel Remap</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>BLE channel 39 is mapped to BLE channel 39, 2.480 GHz</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>BLE channel 39 is mapped to MBAN channel 39, 2.399 GHz</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZOC</name>
                     <description>802.15.4 Channel Number Override</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>802.15.4 channel number comes from the 802.15.4 Link Layer</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>802.15.4 channel number comes from the CHANNEL_NUM register (802.15.4 protocols 4 and 5)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOCK_DETECT</name>
               <description>PLL Lock Detect Control</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0x606800</resetValue>
               <fields>
                  <field>
                     <name>CT_FAIL</name>
                     <description>Real time status of Coarse Tune Fail signal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CTFF</name>
                     <description>CTUNE Failure Flag, held until cleared</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS_FAIL</name>
                     <description>Real time status of Cycle Slip circuit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CSFF</name>
                     <description>Cycle Slip Failure Flag, held until cleared</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FT_FAIL</name>
                     <description>Real time status of Frequency Target Failure</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FTFF</name>
                     <description>Frequency Target Failure Flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAFF</name>
                     <description>TSM Abort Failure Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_LDF_LEV</name>
                     <description>CTUNE Lock Detect Fail Level</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FTF_RX_THRSH</name>
                     <description>RX Frequency Target Fail Threshold</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>FTW_RX</name>
                     <description>RX Frequency Target Window time select</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>4 us</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>8 us</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTF_TX_THRSH</name>
                     <description>TX Frequency Target Fail Threshold</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field derivedFrom="FTW_RX" > <name>FTW_TX</name> <description>TX Frequency Target Window time select</description> <bitOffset>27</bitOffset> </field>
                  <field>
                     <name>FREQ_COUNT_GO</name>
                     <description>Start the Frequency Meter</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FREQ_COUNT_FINISHED</name>
                     <description>Frequency Meter has finished the Count Time</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FREQ_COUNT_TIME</name>
                     <description>Frequency Meter Count Time</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>10 us</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>25 us</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>50 us</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>100 us</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HPM_CTRL</name>
               <description>PLL High Port Modulator Control</description>
               <addressOffset>0x10</addressOffset>
               <resetValue>0x90840000</resetValue>
               <fields>
                  <field>
                     <name>HPM_SDM_IN_MANUAL</name>
                     <description>Manual High Port SDM Fractional value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>HPFF</name>
                     <description>HPM SDM Invalid Flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_SDM_OUT_INVERT</name>
                     <description>Invert HPM SDM Output</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_SDM_IN_DISABLE</name>
                     <description>Disable HPM SDM Input</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_LFSR_SIZE</name>
                     <description>HPM LFSR Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>LFSR 9, tap mask 100010000</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>LFSR 10, tap mask 1001000000</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>LFSR 11, tap mask 11101000000</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>LFSR 13, tap mask 1101100000000</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>LFSR 15, tap mask 111010000000000</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>LFSR 17, tap mask 11110000000000000</description>
                           <value>0b101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HPM_DTH_SCL</name>
                     <description>HPM Dither Scale</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_DTH_EN</name>
                     <description>Dither Enable for HPM LFSR</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_INTEGER_SCALE</name>
                     <description>High Port Modulation Integer Scale</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>No Scaling</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Multiply by 2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Divide by 2</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HPM_INTEGER_INVERT</name>
                     <description>Invert High Port Modulation Integer</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_CAL_INVERT</name>
                     <description>Invert High Port Modulator Calibration</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_MOD_IN_INVERT</name>
                     <description>Invert High Port Modulation</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
