podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_PLL_DIG_MKW41Z4.svd.xml
            <register>
               <name>HPMCAL_CTRL</name>
               <description>PLL High Port Calibration Control</description>
               <addressOffset>0x14</addressOffset>
               <resetValue>0x40000221</resetValue>
               <fields>
                  <field>
                     <name>HPM_CAL_FACTOR</name>
                     <description>High Port Modulation Calibration Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HPM_CAL_NOT_BUMPED</name>
                     <description>HPM_CAL_NOT_BUMPED</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_CAL_COUNT_SCALE</name>
                     <description>HPM_CAL_COUNT_SCALE</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HP_CAL_DISABLE</name>
                     <description>Disable HPM Manual Calibration</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_CAL_FACTOR_MANUAL</name>
                     <description>Manual HPM Calibration Factor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>HPM_CAL_ARRAY_SIZE</name>
                     <description>High Port Modulation Calibration Array Size</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>128</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>256</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HPM_CAL_TIME</name>
                     <description>High Port Modulation Calibration Time</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>25 us</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>50 us</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HPM_CAL1</name>
               <description>PLL High Port Calibration Result 1</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0x44300000</resetValue>
               <fields>
                  <field>
                     <name>HPM_COUNT_1</name>
                     <description>High Port Modulation Counter Value 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CS_WT</name>
                     <description>Cycle Slip Wait Time</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>128 us</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>256 us</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>384 us</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>512 us</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>640 us</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>768 us</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>896 us</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>1024 us</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CS_FW</name>
                     <description>Cycle Slip Flag Window</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>8 us</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>16 us</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>24 us</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>32 us</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>64 us</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>96 us</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>128 us</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>256 us</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CS_FCNT</name>
                     <description>Cycle Slip Flag Count</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HPM_CAL2</name>
               <description>PLL High Port Calibration Result 2</description>
               <addressOffset>0x1C</addressOffset>
               <resetValue>0x2100000</resetValue>
               <fields>
                  <field>
                     <name>HPM_COUNT_2</name>
                     <description>High Port Modulation Counter Value 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CS_RC</name>
                     <description>Cycle Slip Recycle</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS_FT</name>
                     <description>Cycle Slip Flag Timeout</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HPM_SDM_RES</name>
               <description>PLL High Port Sigma Delta Results</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0x1000000</resetValue>
               <fields>
                  <field>
                     <name>HPM_NUM_SELECTED</name>
                     <description>High Port Modulator SDM Numerator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HPM_DENOM</name>
                     <description>High Port Modulator SDM Denominator</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>HPM_COUNT_ADJUST</name>
                     <description>HPM_COUNT_ADJUST</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPM_CTRL</name>
               <description>PLL Low Port Modulator Control</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0x8080000</resetValue>
               <fields>
                  <field>
                     <name>PLL_LD_MANUAL</name>
                     <description>Manual PLL Loop Divider value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>PLL_LD_DISABLE</name>
                     <description>Disable PLL Loop Divider</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPFF</name>
                     <description>LPM SDM Invalid Flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPM_SDM_INV</name>
                     <description>Invert LPM SDM</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPM_DISABLE</name>
                     <description>Disable LPM SDM</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPM_DTH_SCL</name>
                     <description>LPM Dither Scale</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>-128 to 96</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>-256 to 192</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>-512 to 384</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>-1024 to 768</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>-2048 to 1536</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>-4096 to 3072</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>-8192 to 6144</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPM_D_CTRL</name>
                     <description>LPM Dither Control in Override Mode</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPM_D_OVRD</name>
                     <description>LPM Dither Override Mode Select</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPM_SCALE</name>
                     <description>LPM Scale Factor</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>No Scaling</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Multiply by 2</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Multiply by 4</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Multiply by 8</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>Multiply by 16</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>Multiply by 32</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Multiply by 64</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>Multiply by 128</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>Multiply by 256</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>Multiply by 512</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>Multiply by 1024</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Multiply by 2048</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPM_SDM_USE_NEG</name>
                     <description>Use the Negedge of the Sigma Delta clock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPM_SDM_CTRL1</name>
               <description>PLL Low Port Sigma Delta Control 1</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x260026</resetValue>
               <fields>
                  <field>
                     <name>LPM_INTG_SELECTED</name>
                     <description>Low Port Modulation Integer Value Selected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HPM_ARRAY_BIAS</name>
                     <description>Bias value for High Port DAC Array Midpoint</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LPM_INTG</name>
                     <description>Manual Low Port Modulation Integer Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SDM_MAP_DISABLE</name>
                     <description>Disable SDM Mapping</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPM_SDM_CTRL2</name>
               <description>PLL Low Port Sigma Delta Control 2</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0x2000000</resetValue>
               <fields>
                  <field>
                     <name>LPM_NUM</name>
                     <description>Low Port Modulation Numerator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPM_SDM_CTRL3</name>
               <description>PLL Low Port Sigma Delta Control 3</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0x4000000</resetValue>
               <fields>
                  <field>
                     <name>LPM_DENOM</name>
                     <description>Low Port Modulation Denominator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPM_SDM_RES1</name>
               <description>PLL Low Port Sigma Delta Result 1</description>
               <addressOffset>0x34</addressOffset>
               <access>read-only</access>
               <resetValue>0xE200000</resetValue>
               <fields>
                  <field>
                     <name>LPM_NUM_SELECTED</name>
                     <description>Low Port Modulation Numerator Applied</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPM_SDM_RES2</name>
               <description>PLL Low Port Sigma Delta Result 2</description>
               <addressOffset>0x38</addressOffset>
               <access>read-only</access>
               <resetValue>0x4000000</resetValue>
               <fields>
                  <field>
                     <name>LPM_DENOM_SELECTED</name>
                     <description>Low Port Modulation Denominator Selected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DELAY_MATCH</name>
               <description>PLL Delay Matching</description>
               <addressOffset>0x3C</addressOffset>
               <resetValue>0x204</resetValue>
               <fields>
                  <field>
                     <name>LPM_SDM_DELAY</name>
                     <description>Low Port SDM Delay Matching</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>HPM_SDM_DELAY</name>
                     <description>High Port SDM Delay Matching</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>HPM_INTEGER_DELAY</name>
                     <description>High Port Integer Delay Matching</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
