podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_PLL_DIG_MKW41Z4.svd.xml
            <register>
               <name>CTUNE_CTRL</name>
               <description>PLL Coarse Tune Control</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>CTUNE_TARGET_MANUAL</name>
                     <description>Manual Coarse Tune Target</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_TARGET_DISABLE</name>
                     <description>Disable Coarse Tune Target</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_ADJUST</name>
                     <description>Coarse Tune Count Adjustment</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_MANUAL</name>
                     <description>Manual Coarse Tune Setting</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_DISABLE</name>
                     <description>Coarse Tune Disable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTUNE_CNT6</name>
               <description>PLL Coarse Tune Count 6</description>
               <addressOffset>0x44</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CTUNE_COUNT_6</name>
                     <description>CTUNE Count 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTUNE_CNT5_4</name>
               <description>PLL Coarse Tune Counts 5 and 4</description>
               <addressOffset>0x48</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CTUNE_COUNT_4</name>
                     <description>CTUNE Count 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_COUNT_5</name>
                     <description>CTUNE Count 5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTUNE_CNT3_2</name>
               <description>PLL Coarse Tune Counts 3 and 2</description>
               <addressOffset>0x4C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CTUNE_COUNT_2</name>
                     <description>CTUNE Count 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_COUNT_3</name>
                     <description>CTUNE Count 3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTUNE_CNT1_0</name>
               <description>PLL Coarse Tune Counts 1 and 0</description>
               <addressOffset>0x50</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CTUNE_COUNT_0</name>
                     <description>CTUNE Count 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_COUNT_1</name>
                     <description>CTUNE Count 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTUNE_RES</name>
               <description>PLL Coarse Tune Results</description>
               <addressOffset>0x54</addressOffset>
               <access>read-only</access>
               <resetValue>0x9620040</resetValue>
               <fields>
                  <field>
                     <name>CTUNE_SELECTED</name>
                     <description>Coarse Tune Setting to VCO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_BEST_DIFF</name>
                     <description>Coarse Tune Absolute Best Difference</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_FREQ_SELECTED</name>
                     <description>Coarse Tune Frequency Selected</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
